In [24]:
#series
import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
#create a series from dictionary

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [26]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [27]:
# Dataframe

# create dataframe from a dictionary of list

data ={
    'Name':['krish','john','jack'],
    'Age':[25,30,45],
    'City':['banglore','new york','florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  krish   25  banglore
1   john   30  new york
2   jack   45   florida
<class 'pandas.core.frame.DataFrame'>

In [28]:
## create a dataframe from list of dictionaries

data = [
    'Name':['krish','john','jack'],
    'Age':[25,30,45],
    'City':['banglore','new york','florida']
]

SyntaxError: invalid syntax (3083102074.py, line 4)

In [ ]:
df = pd.read_csv('sales_data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [ ]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [ ]:
## accessing a specified element 
data ={
    'Name':['krish','john','jack'],
    'Age':[25,30,45],
    'City':['banglore','new york','florida']
}

df=pd.DataFrame(data)
print(df.at[2,'Age'])

45

In [ ]:
## adding a column
df['salary']=[50000,60000,70000]
df

    Name  Age      City  salary
0  krish   25  banglore   50000
1   john   30  new york   60000
2   jack   45   florida   70000

In [34]:
## remove a column
df.drop('salary',axis=1,inplace=True,errors='ignore')
df

    Name  Age      City
0  krish   25  banglore
1   john   30  new york
2   jack   45   florida

In [36]:
##add age to the column
df['Age']=df['Age']+1
df

    Name  Age      City
0  krish   26  banglore
1   john   31  new york
2   jack   46   florida

In [37]:
df = pd.read_csv('sales_data.csv')
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000